src/Catalogs/уатСценарииПланирования/уатСценарииПланирования.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>уатСценарииПланирования</name>
  <comment>Сценарии планирования (уат)</comment>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>Раздел</name>
    <type>
      <types>EnumRef.уатРазделыПланирования</types>
    </type>
  </attributes>
  <attributes>
    <name>Периодичность</name>
    <type>
      <types>EnumRef.Периодичность</types>
    </type>
  </attributes>
  <attributes>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>ПолучательУслуг</name>
    <type>
      <types>EnumRef.уатПолучателиУслуг</types>
    </type>
  </attributes>
  <attributes>
    <name>ВедущийСценарий</name>
    <type>
      <types>CatalogRef.уатСценарииПланирования</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидПланирования</name>
    <type>
      <types>EnumRef.уатВидыПланирования</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьКраткосрочноеПланирование</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПериодичностьКраткосрочногоПланирования</name>
    <type>
      <types>EnumRef.Периодичность</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьОперативноеПланирование</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>АвтоматическиСоздаватьЗаказыНаТС</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>АвтоматическиСоздаватьРазнарядкиНаВыпускТС</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтображатьНомерПериода</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьДетализацияПланирования</name>
    <comment>Детализация планирования</comment>
    <type>
      <types>EnumRef.уатДетализацияПланирования</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьПланированиеПоГруппамУслуг</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>РежимЗаполненияВесаОбъемаГруза</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПараметрВыработки</name>
    <type>
      <types>CatalogRef.уатПараметрыВыработки</types>
    </type>
  </attributes>
  <attributes>
    <name>ПланированиеОбъемовВПроцентах</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>РазрезыПланирования</name>
    <attributes>
      <name>РазрезПланирования</name>
      <type>
        <types>EnumRef.уатРазрезыПланирования</types>
      </type>
    </attributes>
    <attributes>
      <name>ПланированиеПоГруппам</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ВариантАналитики</name>
      <type>
        <types>EnumRef.уатВариантыАналитик</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>РазрезыПоказателейПланирования</name>
    <attributes>
      <name>РазрезПланирования</name>
      <type>
        <types>EnumRef.уатРазрезыПланирования</types>
      </type>
    </attributes>
    <attributes>
      <name>ПланированиеПоГруппам</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ВариантАналитики</name>
      <type>
        <types>EnumRef.уатВариантыАналитик</types>
      </type>
    </attributes>
    <attributes>
      <name>ПараметрВыработки</name>
      <type>
        <types>CatalogRef.уатПараметрыВыработки</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/Catalogs/уатСценарииПланирования/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// СтандартныеПодсистемы.ЗапретРедактированияРеквизитовОбъектов

// Позволяет определить список заблокированных реквизитов.
// 
// Возвращаемое значение:
//  Массив - из Строка - строки в формате "ИмяРеквизита[;ИмяЭлементаФормы,...]",
//  где ИмяРеквизита - имя реквизита объекта, ИмяЭлементаФормы -
//  имя элемента формы, связанного с реквизитом. Например: "Объект.Автор", "ПолеАвтор".
//
Функция ПолучитьБлокируемыеРеквизитыОбъекта() Экспорт
	
	БлокируемыеРеквизиты = Новый Массив();
	
	БлокируемыеРеквизиты.Добавить("Периодичность");
	БлокируемыеРеквизиты.Добавить("ПериодичностьКраткосрочногоПланирования");
	БлокируемыеРеквизиты.Добавить("Валюта");
	БлокируемыеРеквизиты.Добавить("ПараметрВыработки");
	БлокируемыеРеквизиты.Добавить("ПланированиеОбъемовВПроцентах");
	
	Возврат БлокируемыеРеквизиты;
	
КонецФункции

// Конец СтандартныеПодсистемы.ЗапретРедактированияРеквизитовОбъектов

#КонецОбласти

#КонецЕсли
